Periodic_Hill_Charbel/periodicHill/spaldingSim/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}

simulationType  LES;

LES
{
    model       WALE;
    delta       cubeRootVol;

    turbulence  on;
    printCoeffs on;
}

// ************************************************************************* //
