Periodic_Hill_Charbel/periodicHill/spaldingSim/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          2400;
        startFace       849600;
        matchTolerance  0.0001;
        neighbourPatch  outlet;
        transformType   translational;
        separation      (-9 0 0);
    }
    outlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          2400;
        startFace       852000;
        matchTolerance  0.0001;
        neighbourPatch  inlet;
        transformType   translational;
        separation      (9 0 0);
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          7200;
        startFace       854400;
    }
    hills
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          7200;
        startFace       861600;
    }
    front
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          4800;
        startFace       868800;
        matchTolerance  0.0001;
        neighbourPatch  back;
        transformType   translational;
        separation      (0 0 -4.5);
    }
    back
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          4800;
        startFace       873600;
        matchTolerance  0.0001;
        neighbourPatch  front;
        transformType   translational;
        separation      (0 0 4.5);
    }
)

// ************************************************************************* //
